Revit 2027 API
ScheduleSortOrder Enumeration
 Options for sort order of rows in a schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ScheduleSortOrder
Public Enumeration ScheduleSortOrder
public enum class ScheduleSortOrder
type ScheduleSortOrder
Members
Member name | Value | Description
Ascending | 0 |  Sort in ascending order.
Descending | 1 |  Sort in descending order.
See Also
Reference
Autodesk.Revit.DB Namespace